Revit 2027 API
PickedBox.Max Property
Maximum coordinates (upper-right-front corner of the pick box).
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Max { get; set; }
Public Property Max As XYZ
	Get
	Set
public:
property XYZ^ Max {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Max : XYZ with get, set
Property Value
XYZ
See Also
Reference
PickedBox Class
Autodesk.Revit.UI.Selection Namespace